package constants

// 클라이언트에게 반환되는 메시지 상수입니다.
const (
	// ------------------------------------------------------------------------------------------------
	// 성공 응답 메시지
	// ------------------------------------------------------------------------------------------------

	MsgSuccess = "성공"

	// ------------------------------------------------------------------------------------------------
	// 일반 HTTP 에러 (상태 코드 순)
	// ------------------------------------------------------------------------------------------------

	// 400 Bad Request
	ErrMsgBadRequest            = "잘못된 요청입니다"

	// 401 Unauthorized
	ErrMsgUnauthorizedInvalidAppKey         = "app_key가 유효하지 않습니다 (application_id: %s)"
	ErrMsgUnauthorizedNotFoundApplicationID = "등록되지 않은 application_id입니다 (ID: %s)"
)
